"""С проверкой по ошибке ввода символов второго блока try/except"""

"""С клавиатуры вводятся N чисел. Составьте программу, которая
определяет количество отрицательных, количество положительных
и количество нулей среди введенных чисел. Значение N вводится с
клавиатуры. При вводе нечислового значения вывести сообщение
об ошибке и просим ввести повторно именно числовое значение.
Используйте цикл for."""

n_chisel = input("Введите количество целых чисел: ")
while not n_chisel.isdigit():
    n_chisel = input(f"Ошибка!!! Введено некорректное значение: {n_chisel}\nПопробуйте еще раз:  ")
    continue
n_chisel = int(n_chisel)

a = 0  # количествово отрицательных чисел
b = 0  # количество положительных чисел
c = 0  # количество нулей

for _ in range(n_chisel):
    while True:
        try:
            num = int(input(f"Введите число № {_ + 1}: "))
            break
        except ValueError:
            print("Ошибка!!! Введено нечисловое значение.")

    if num > 0:
        a += 1
    if num < 0:
        b += 1
    if num == 0:
        c += 1

print("\nКоличество положительных чисел:", a)
print("Количество отрицательных чисел:", b)
print("Количество нулей:", c)
